tmp/vllm_logs/sweep/v2_mml9216_mnb512_mns256_client.log
INFO 09-01 19:27:08 [__init__.py:76] TPU info: node_name=cuiq-infer-tpu7x-8-3 | tpu_type=tpu7x-8 | worker_id=0 | num_chips=8 | num_cores_per_chip=2
WARNING 09-01 19:27:08 [tpu_platform.py:447] Pin memory is not supported on TPU.
/home/ymu_google_com/miniconda3/envs/vllm12/lib/python3.12/site-packages/torch/cuda/__init__.py:1007: UserWarning: Can't initialize NVML
  raw_cnt = _raw_device_count_nvml()
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=256, model='Qwen/Qwen3.5-397B-A17B-FP8', tokenizer=None, use_beam_search=False, num_prompts=512, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', chat_template_system_prompt='Reasoning effort: high', chat_template_kwargs='{}', mmlu_input_len=None, mmlu_output_len=None, mmlu_num_shots=1, mmlu_method='HELM', mmlu_use_chat_template=False, mlperf_input_len=None, mlperf_output_len=None, gpqa_output_len=2048, gpqa_use_chat_template=False, mmmu_pro_subset='vision', mmmu_pro_output_len=16, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, random_input_len=1024, random_output_len=1024, random_range_ratio=0.8, random_prefix_len=0, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, run_eval=False, warmup_mode='sampled', debug=False)
Using sampling parameters: {'temperature': 0.0}
Warmup (mode: sampled) is starting.
100%|██████████| 6/6 [01:32<00:00, 15.34s/it]
Warmup (mode: sampled) has completed.
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 256
100%|██████████| 512/512 [03:13<00:00,  2.65it/s]
============ Serving Benchmark Result ============
Successful requests:                     512       
Benchmark duration (s):                  193.55    
Total input tokens:                      312698    
Total generated tokens:                  315328    
Request throughput (req/s):              2.65      
Output token throughput (tok/s):         1629.22   
Total token throughput (tok/s):          3244.85   
---------------Time to First Token----------------
Mean TTFT (ms):                          21767.97  
Median TTFT (ms):                        20031.67  
P99 TTFT (ms):                           60616.00  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          95.59     
Median TPOT (ms):                        96.90     
P99 TPOT (ms):                           151.64    
---------------Inter-token Latency----------------
Mean ITL (ms):                           94.59     
Median ITL (ms):                         35.91     
P99 ITL (ms):                            237.79    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          79929.51  
Median E2EL (ms):                        80097.70  
P99 E2EL (ms):                           151974.70 
==================================================