tmp/vllm_logs/sweep/v2_mml9216_mnb512_mns64_client.log
INFO 09-01 21:45:48 [__init__.py:76] TPU info: node_name=cuiq-infer-tpu7x-8-3 | tpu_type=tpu7x-8 | worker_id=0 | num_chips=8 | num_cores_per_chip=2
WARNING 09-01 21:45:49 [tpu_platform.py:447] Pin memory is not supported on TPU.
/home/ymu_google_com/miniconda3/envs/vllm12/lib/python3.12/site-packages/torch/cuda/__init__.py:1007: UserWarning: Can't initialize NVML
  raw_cnt = _raw_device_count_nvml()
Namespace(backend='vllm', base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=512, model='Qwen/Qwen3.5-397B-A17B-FP8', tokenizer=None, use_beam_search=False, num_prompts=1024, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', chat_template_system_prompt='Reasoning effort: high', chat_template_kwargs='{}', mmlu_input_len=None, mmlu_output_len=None, mmlu_num_shots=1, mmlu_method='HELM', mmlu_use_chat_template=False, mlperf_input_len=None, mlperf_output_len=None, gpqa_output_len=2048, gpqa_use_chat_template=False, mmmu_pro_subset='vision', mmmu_pro_output_len=16, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, random_input_len=1024, random_output_len=1024, random_range_ratio=0.8, random_prefix_len=0, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, run_eval=False, warmup_mode='sampled', debug=False)
Using sampling parameters: {'temperature': 0.0}
Warmup (mode: sampled) is starting.
100%|██████████| 6/6 [01:51<00:00, 18.64s/it]
Warmup (mode: sampled) has completed.
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 512
100%|██████████| 1024/1024 [02:55<00:00,  5.85it/s]
============ Serving Benchmark Result ============
Successful requests:                     1024      
Benchmark duration (s):                  175.02    
Total input tokens:                      627782    
Total generated tokens:                  622325    
Request throughput (req/s):              5.85      
Output token throughput (tok/s):         3555.74   
Total token throughput (tok/s):          7142.66   
---------------Time to First Token----------------
Mean TTFT (ms):                          6501.20   
Median TTFT (ms):                        3060.71   
P99 TTFT (ms):                           30027.98  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          106.27    
Median TPOT (ms):                        114.32    
P99 TPOT (ms):                           154.01    
---------------Inter-token Latency----------------
Mean ITL (ms):                           104.71    
Median ITL (ms):                         46.15     
P99 ITL (ms):                            246.96    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          70034.10  
Median E2EL (ms):                        64425.65  
P99 E2EL (ms):                           131615.52 
==================================================